RIET/src/Documents/КорректировкаОС1/КорректировкаОС1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаОС1</name>
  <registerRecords>AccumulationRegister.СтоимостьАмортизацияОС</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтоимостьБУ</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговыйПериод</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <comment>(Регл)</comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АмортизацияНУ</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговыйПериод</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <comment>(Регл)</comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КапитальныеВложения</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговыйПериод</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <comment>(Регл)</comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Налоги</name>
    <attributes>
      <name>Налог</name>
      <type>
        <types>EnumRef.ВидыНалоговыхНачислений</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговыйПериод</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <comment>(Регл)</comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/СтоимостьАмортизацияОС/СтоимостьАмортизацияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьАмортизацияОС</name>
  <resources>
    <name>СтоимостьБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АмортизацияБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АмортизацияНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/КорректировкаОС1/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	табДвижений = Новый ТаблицаЗначений;
	табДвижений = СтоимостьБУ.ВыгрузитьКолонки();
	табДвижений.Индексы.Добавить("СуммаКВ", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	//табДвижений.Индексы.Добавить("СтоимостьБУ", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	табДвижений.Индексы.Добавить("АмортизацияНУ", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
    	
	Для Каждого Запись Из СтоимостьБУ Цикл
		НоваяСтрока = табДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
	КонецЦикла;
	
	Для Каждого Запись Из АмортизацияНУ Цикл
		НоваяСтрока = табДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
	КонецЦикла;
	
	Для Каждого Запись Из КапитальныеВложения Цикл
		НоваяСтрока = табДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
	КонецЦикла;	

	табДвижений.Свернуть("ОсновноеСредство, Подразделение, НалоговыйПериод", "СуммаКВ, СтоимостьБУ, АмортизацияНУ");  
	Для Каждого Запись Из табДвижений Цикл
		Движение = Движения.СтоимостьАмортизацияОС.ДобавитьПриход();
		Движение.Период = ДатаПроведения;
		ЗаполнитьЗначенияСвойств(Движение, Запись);
	КонецЦикла;
	
	
КонецПроцедуры
